{
  "id": "20250829_125433",
  "source": "User prompt: USA Politics",
  "idea": "Title: \"Washington Wobble Dance-off\"\n\nFirst 3 seconds: Split screen of a donkey and an elephant putting on dancing shoes (hook). \n\nNext 10 seconds: They start dancing in synchrony to a funky tune. The elephant doing the 'floss', the donkey performing the 'robot' - all with exceptional energy and commitment!\n\nNext 14 seconds: Surprise cameo - An eagle pops in with sunglasses, snaps its fingers, and the music changes to a viral TikTok tune. The elephant and donkey start the trending challenge upon the beat drop. \n\nFinal 3 seconds: Text pops up with hashtag \"#WashingtonWobble\". Voiceover: \"United in rhythm. Share your moves with #WashingtonWobble. Let's dance to the beat of unity!\"\n\nThis ad combines humor, surprise element of politicians as dancing animals, relatability to universal enjoyment of dance, and emotional appeal of unity. It encourages people to share their dance moves, which leads to high potential virality.",
  "script": "First 3 seconds: Split screen. On your left, a donkey in a snazzy suit struggles to put on dancing shoes. On the right, an elephant ties its ballet slippers with ease - inviting curiosity and humor. Funky suspense music plays in the background.\n\n4-13 seconds: The screen unifies just as a groovy tune starts playing and our characters erupt into dance! The donkey performs an epic retro 'Robot' while the elephant blows your mind performing the 'Floss' dance. Laughter and enjoyment, akin to watching a dance-off.\n\n14-27 seconds: An eagle wearing sunglasses suddenly swoops into the scene, snapping its fingers to shift gears. The music flips to the latest TikTok sensation. The elephant and donkey instantly get with the program, mimicking the viral dance routine and joining the beat drop. Moments of surprise, humor and \"in on the joke\" feeling.\n\n28-30 seconds: The screen fades to black while \"#WashingtonWobble\" pops up in bold, lively colors. A booming yet friendly voiceover says, \"United in rhythm. Share your moves with #WashingtonWobble. Let's dance to the beat of unity!\" As the call to action resonates, a steady beat continues faintly in the backdrop. \n\nThe ad combines elements of humor (elephant and donkey dancing), unexpected turns (an eagle joining in, music shift to TikTok trend), and a universally relatable joy of dancing, while subtly alluding to political unity. The challenge to share own dance moves under \"#WashingtonWobble\" creates an immediate potential for virality.",
  "virality_score": 83,
  "duration_seconds": 30,
  "timestamp": "20250829_125433",
  "status": "completed",
  "video_file": "videos/ad_20250829_125433.mp4",
  "thumbnail": "thumbnails/ad_20250829_125433.jpg",
  "audio_file": "audio/ad_20250829_125433.mp3",
  "virality_assessment": "🔥 Highly Viral - Excellent potential for mass sharing"
}